Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །རྒྱ་མཚོ་ཆེན་པོ་ཟབ་མོའི་ཆུའི་རིགས་དཀུ་དང་མཉམ་ཞིང་མཚུངས་པའི་ལུས་སུ་རིག་པར་བྱའོ། །དེ་མ་ཐག་ཏུ་ལྷུན་པོ་ཆེན་པོའི་ལུས་སུ་རིག་པར་བྱའོ།
en: Such bodies should be known to be capable of appearing as a great ocean with its deep waters and curved shorelines, or suddenly becoming as big as the great Mount Sumeru.

source: །ནམ་མཁའ་ཆེན་པོ་ཡོངས་སུ་དག་པ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དང་འདྲ་བར་འགྱུར་ཏེ།
en: They can appear as the great expanse of the sky, completely pure, or take on an appearance of a great jewel.

source: ལྷའི་ལུས་དང་ལྷའི་ཁམས་ཀྱི་སྙིང་པོ་མཉམ་པའི་ལུས་སུ་རིག་པར་བྱའོ།
en: They should be known as divine bodies, equal to receptacles of divine relics.

source: །དེ་ལྟར་མཐུ་ཆེན་པོ་དང་སྟོབས་ཆེན་པོ་ཞེས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་ཤིང་ལུང་བསྟན་པར་འགྱུར་ཏེ།
en: A vidyā holder with such a body will thus possess great power and might. He will be blessed by all the tathāgatas and will receive a prophecy from them about his future awakening.

source: ལུས་ཆེན་པོར་ཡང་འགྱུར་རོ།
en: His body will be great indeed. “

source: །བཅོམ་ལྡན་འདས་འོན་ཀྱང་སེམས་ཅན་སྒྲུབ་དཀའ་བ། ཁོང་དུ་ཆུད་པར་དཀའ་བ། གཏིང་དཔག་པར་དཀའ་བ།
en: However, O Blessed One, beings are difficult to control; it is difficult for them to awaken or to open up.

source: དད་པ་མེད་པ། སེར་སྣས་ཡོངས་སུ་དཀྲིས་པ། སྡིག་པ་དང་། གདུག་བ་དང་། ལྷག་མ་དང་།
en: They lack faith, are prone to envy, and are enveloped by evil and vice.

source: སྦགས་པ་དང་། ཁྲོ་བ་དང་།
en: Pure and impure at once, they are full of anger and wickedness.

source: ཞེ་གདུག་པ་མང་བ་དེས་ནི་བཅོམ་ལྡན་འདས་སེམས་ཅན་རང་གི་ཉེས་པ་ལགས་ཀྱི་བཅོམ་ལྡན་འདས་བདག་གིས་ཉེས་པ་ནི་མ་ལགས་སོ།
en: For that reason, O Blessed One, sentient beings perpetuate their own nonvirtue, and I am not at fault.

source: །བཅོམ་ལྡན་འདས་འོན་ཀྱང་བདག་དྲན་པ་ཙམ་གྱིས་སྙིང་པོ་འདི་ཀློག་པ་དང་། ཁ་ཏོན་དུ་བྱེད་པ་དང་། བཟླས་པ་ཙམ་གྱིས་ཡང་དག་པར་དགོངས་པར་བགྱི་མཐོང་བ་སྩལ་བར་བགྱིའོ།
en: But I will, O Blessed One, think of them and appear to them as soon as they remember, keep in their hearts, read, study, and recite this manual.

source: །ཡང་དང་ཡང་དུ་བསྐུལ་བར་བགྱིའོ། །བཅོམ་ལྡན་འདས་སེམས་ཅན་དེ་རྣམས་ནི་བདག་ལ་ལྟ་བར་མི་བྱེད་པ་དང་།
en: I keep encouraging them again and again, but these beings, O Blessed One, do not see me.

source: བསམ་པར་མི་བྱེད་པ་དང་། སེམས་པར་མི་བྱེད་པ་དང་།
en: They do not think of me or contemplate me.

source: སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཡིད་ལ་བྱེད་པས་ཀུན་ཏུ་འཛིན་པར་མི་བྱེད་ལགས་ཏེ། གདུག་པའི་བསམ་པ་དང་།
en: They do not keep me in mind for even the shortest moment.

source: གདུག་པའི་སེམས་ཀྱིས་སེམས་ཅན་རང་གི་ཉེས་པས་ཡང་དག་པར་གང་བའི་ལུས་ལགས་སོ།
en: Their hearts and minds are corrupt, and their inner nature is dominated by their own faults.

source: །བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་པ་དང་། དྲན་པ་དང་། རྣམ་པར་ལྟ་བར་བྱེད་པ་ཙམ་གྱི་མོད་ལ་མདུན་ན་ཉེ་བར་འདུག་པར་བགྱི།
en: But as soon as they think of me, remember me, or turn to me, I will, O Blessed One, stand right in front of them.

source: མཐོང་བ་དང་ཡང་དག་པའི་གཏམ་ཀུན་ཏུ་སྨྲ་བ་དང་། ཡང་དག་པར་འགྲོགས་པར་བགྱིའོ། །སེམས་ཅན་དེ་རྣམས་ནི་རིག་སྔགས་འཆང་ཐ་ན་སེམས་ཀྱི་ཀུན་ཏུ་རྟོག་པ་ཙམ་ཡང་མི་སྐྱེ་སྟེ། ཡིད་ལ་བྱེད་པ་དང་།
en: I will stay with them so that they can see me, speak to me, and make friends with me. “

source: སེམས་པར་བྱེད་པ་ཡང་མ་ལགས་སོ། །འདི་ལྟ་སྟེ། དགེ་སྦྱོང་གི་ཆ་བྱད་སྐྲ་བཞར་ཞིང་ངུར་སྨྲིག་ཙམ་འཆང་བའི་ཆ་བྱད་ནི་བྲམ་ཟེ་དང་། རྒྱལ་རིགས་ཀྱི་ཆ་བྱད་དང་། ཚོང་པ་དང་དེད་དཔོན་ཆེན་པོའི་ཆ་བྱད་དང་། བྱིས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཆ་བྱད་དང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་། འགྲོགས་བཤེས་དང་། གོས་དམར་པོ་ཅན་ལ་མཁན་པོ་དང་།
en: But neither these beings nor the vidyā holders will recognize me, not even by way of premonition, nor will they pay homage to me when I appear in the garb of a renunciant with a shaven head and saffron robe, or the garb of a brahmin or a kṣatriya, or the garb of a well-to-do merchant, caravan leader, or child, or the garb of the Blessed One.

source: སློབ་དཔོན་དང་མཚུངས་པར་མཁན་པོ་དང་། བུ་དང་། བུ་མོ་དང་། མ་དང་། ཕ་དང་།
en: I may also appear to them in the form of a king, a minister, an ally, a friend, a relative, a teacher, a master, a preceptor who gives common vows, or a son, daughter, mother, father, or sister. “

source: སྲིང་མོར་ཉེ་བར་ལྟ་བར་བྱེད་དོ། །འོན་ཀྱང་མཁས་པ་ནི་ལྷག་པའི་བསམ་པ་ཡང་དག་པར་རྫོགས་པ་ལ་གནས་པས། གཟུགས་དང་། ཁ་དོག་དང་། རྟགས་དང་། དབྱིབས་དང་།
en: Those, however, who have the disposition of a learned man will recognize the signs conveyed by my appearance, form, and the combination of other factors.

source: སྐད་དང་། ཡང་དག་པའི་གཏམ་སྨྲ་བ་དང་། ཚིག་འབྲུ་དང་། ཡི་གེ་དང་། དུས་ཚིགས་སུ་འགྲོ་བ་ཡང་དག་པར་མཚོན་པར་བྱ།
en: They will understand the combinations of letters and words in my speech and recognize the things that I say.

source: ཡང་དང་ཡང་དུ་གཏམ་ཀུན་ཏུ་སྨྲ་བ་ལ་རྣམ་པར་སྤྱད་པར་བྱ།
en: It will, bit by bit, become clear to them, and they will understand.

source: དེའི་འོག་ཏུ་ཤེས་པར་བྱའོ། །འཕགས་པའི་སེམས་ཅན་ནོ་ཞེས་བལྟ་བར་བྱ། བདག་ལ་བལྟ་བར་འདོད་པ་དང་།
en: They will then observe, ‘this is a noble being,’ and they will recognize me.

source: བདག་མཐོང་བར་འདོད་པ་དེར་ཉེ་བར་འགྲོ་བར་བགྱིའོ། །དེ་ལྟ་བུའི་ཆོ་གས་ཤིན་ཏུ་གསལ་བར་མཐོང་བསྩལ་བར་བགྱི།
en: I will approach those who want to see me and, in doing so, allow them to have a clear view.

source: རེ་བ་ཐམས་ཅད་དང་། ཡིད་ཀྱི་ཤིང་རྟ་ཡོངས་སུ་རྫོགས་པར་བགྱི།
en: I will fulfill all their hopes and wishes.

source: སྐྱེ་བོ་ཆེན་པོའི་དབུས་སུ་ཉོ་བ་དང་། འཚོང་བ་དང་། ཀུན་ཏུ་སྨྲ་བ་དང་། ཡང་དག་པར་སྨྲ་བའི་ཐ་སྙད་ཡང་དག་བར་བགྱི། འདུན་སའི་དབུས་སུ་བསྟན་བཅོས་དང་། སྙན་དང་གས་དང་། རིག་བྱེད་དང་། གསང་སྔགས་དང་།
en: When in the midst of merchants, I will do the buying and selling, do the talking, and negotiate bargains.

source: རིགས་པ་དང་། བརྡ་སྤྲོད་པ་དང་། མདོ་སྡེ་དང་། ཟློས་གར་དང་། དྲི་ཟའི་གླུ་དབྱངས་ཀྱི་ཐ་སྙད་ཡང་དག་པར་བགྱི།
en: When in the midst of an assembly, I will pursue the topics of the sciences, poetics, the Vedas, the application of mantras, grammar, the sūtras, drama, and song and music. “

source: བྱང་ཆུབ་སྒྲུབ་པ་ལ་ཚུལ་དང་། འདུལ་བ་དང་། ཐེག་པ་ཆེན་པོའི་ཆོས་ཀྱི་མན་ངག་ལྷག་པར་བགྱི།
en: Regarding books on the subject of awakening, I will explain the doctrine, the rules of discipline, and the philosophy of Mahāyāna.

source: བྲམ་ཟེ་རྣམས་ལ་སྔོན་རབས་དང་། རིག་བྱེད་དང་། མེའི་སྦྱིན་སྲེག་དང་། བྷ་ར་ཏ་དང་། རཱ་མཱ་ཡ་ཎ་བསྟན་པར་བགྱི། གསང་སྔགས་སྨྲ་བ་རྣམས་ལ།
en: To brahmins, I will explain the Purāṇas, the Vedas, fire oblation rituals, the Mahābhārata, and the Rāmāyaṇa.

source: གསང་སྔགས་ཀྱི་བཟླས་བརྗོད་དང་། དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་དང་། ཆོ་ག་ཞིབ་མོ་དང་། གཟུངས་ཀྱི་བཟླས་བརྗོད་དང་། སྦྱིན་སྲེག་དང་། ཞི་བ་དང་། རྒྱས་པ་དང་།
en: To the followers of the mantra path, I will teach mantra recitation, the rituals involving maṇḍalas and mudrās, the recitation of dhāraṇīs, the homa offering, and the rites of pacifying, nourishing, assaulting, and so forth. “

source: མངོན་སྤྱོད་ལ་སོགས་པ་བསྟན་པར་བགྱི། གང་གིས་བདག་མངོན་སུམ་དུ་མདུན་ན་འདུག་བར་ཅི་ཞིག་གིས་ཤེས་པར་བྱ་ཞེ་ན། རྣམ་པ་གསུམ་གྱིས་ཤེས་པར་བྱ་སྟེ། ཚིག་སྙན་པ་དང་།
en: So how does one recognize me when I stand before them in plain sight?

source: འཇམ་ཞིང་མཉེན་པའི་ངག་མི་འགྱུར་ཞིང་ཡོངས་སུ་གསལ་བར་རབ་ཏུ་འབྱེད་པ་ཡིན་པ་དང་། ངག་གསལ་བ་ཡིན་པས་ཏེ། ཐམས་ཅད་དུ་མཆོག་ཏུ་སྨྲ་ཞིང་སོ་སོར་ཁྱད་པར་དུ་བྱེད་པའོ། །ཁ་ནས་ཨུཏྤ་ལའི་དྲི་དང་ལྡན་པའི་རླུང་གནས་པ་དང་། ལུས་ལས་ཀྱང་གླ་རྩིའི་དྲི་གནས་པས་ཏེ། འོན་ཀྱང་འཇིགས་སུ་རུང་བའི་གཟུགས་ལ་ཤིན་ཏུ་དཔལ་གྱིས་འབར་བར་བྱེད་དོ།
en: I can be recognized in three different ways: (1) I am always distinguished as an excellent speaker, as my sweet speech has the sound that is soft and pleasant, its phonemes are pronounced clearly and distinctly, and with its sentences are complete; (2) the breath coming out of my mouth has the rich fragrance of a blue lotus flower, and my body has the strong scent of musk; and (3) anything that has a loathsome form will blaze in my presence with great splendor.

source: །དེས་ན་རིག་སྔགས་འཆང་གིས་གཞན་ནམ། འཇིག་རྟེན་གྱི་རིགས་བཞི་པོ་གང་ཡང་རུང་བ་འདི་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གོ་ཞེས་དེ་གསལ་བར་ཤེས་པར་བྱ་སྟེ།
en: By these signs, the vidyā holder and any person from the four castes can clearly recognize me as Noble Avalokiteśvara.

source: འདི་ལ་ཡིད་གཉིས་དང་དོགས་པ་བསྐྱེད་པར་མི་བྱའོ།
en: This should not be doubted or denied. “

source: །རྨི་ལམ་དུ་ཡང་ཐུན་མཚམས་བཞི་རུ་སྣ་ཚོགས་པའི་གཟུགས་དང་ཁ་དོག་དང་དབྱིབས་སུ་མཐོང་བ་སྩལ་བར་བགྱི། རེ་བ་ཐམས་ཅད་དང་། ཡིད་ཀྱི་ཤིང་རྟའི་མཆོག་རྗེས་སུ་སྩལ་བར་བགྱི། ལྷུན་གྱིས་གྲུབ་བ་ལས་ཕན་པ་ཐམས་ཅད་དང་།
en: In dreams, when various forms and colors appear at the four junctions of the night, I will appear to the vidyā holder and fulfill all his wishes and hopes.

source: ཕུན་སུམ་ཚོགས་པའི་འབྱོར་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི།
en: Without any effort on his part, I will provide everything he needs, creating the right circumstances.

source: བཅོམ་ལྡན་འདས་ནམ་དུ་ཡང་རྣམ་པ་གཞན་དུ་མི་འགྱུར་བར་བགྱིའོ། །ཡོངས་སུ་གཏང་བར་མི་བགྱིའོ།
en: I will never act otherwise or abandon him.

source: །དེ་ནས་མཆོག་སྦྱིན་པ་ལ་ལྟོས་པར་མི་བགྱིའོ།
en: I will never be negligent, O Blessed One, when granting him boons.

source: །བཅོམ་ལྡན་འདས་བརྫུན་དུ་སྨྲ་བ་དེའི་དངོས་གྲུབ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞིང་། ལྷ་རྣམས་དེ་ལ་བསྲུང་བ་དང་། ཡོངས་སུ་སྐྱོང་བར་མི་བགྱིད་པ་ནི་མ་གཏོགས་སོ། །བཅོམ་ལྡན་འདས་དེ་ཡང་སེམས་ཅན་སྡུག་བསྔལ་ཅན་དེའི་སྐྱོབ་པ་དང་། དཔུང་གཉེན་དང་།
en: If I do not see the vidyā holder gaining accomplishment, or if the gods fail to protect or guard him, then, O Blessed One, providing that he does not object, I will make protecting such an unhappy vidyā holder my priority, and I will become his refuge and support.

source: སྐྱབས་དང་། འཁྲ་སར་འགྱུར་བར་བགྱི། གདོན་མི་ཟ་བར་བརྩེ་བ་མེད་པར་འགྱུར་བ་མ་ཡིན་ནོ་ཞེས་མཆོག་ཏུ་བསྒྲལ་བར་བགྱིའོ།
en: I will not lack compassion, and I will certainly deliver him from saṃsāra.

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་སྙིང་རྗེས་ཡོངས་སུ་ཟིན་པའི་ཡིད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པར་བགྱི། ཡང་དག་པར་གཟུང་བར་བགྱི།
en: In the same way, O Blessed One, I will embrace all beings with a mind filled with compassion and deliver them from saṃsāra.

source: སེམས་ཅན་འདི་དག་ལ་གདོན་མི་ཟ་བར་བྱང་ཆུབ་ཀྱི་ས་བོན་རྗེས་སུ་གདབ་པར་བགྱིའོ་ཞེས་སོ།
en: I will support them and will certainly sow in them the seed of awakening.”

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་དང་། ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། ལེགས་སོ་ལེགས་སོ་སེམས་དཔའ་ཆེན་པོ་མཆོག་གི་སྙིང་རྗེ་ཅན།
en: The blessed Tathāgata Śākyamuni and all the tathāgatas in the ten directions applauded Noble Avalokiteśvara, the great bodhisattva being, saying, “Good!

source: ཁྱོད་སེམས་ཅན་ལ་མཉེས་གཤིན་པ་གང་གིས་སེམས་ཅན་དེ་རྣམས་ཐམས་ཅད་སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་བཟུང་སྟེ་མཆོད་པར་བྱེད་ཅིང་། འཁོར་བ་ཆེན་པོར་སྤྱོད་པར་བྱེད་པ་ལས་ཡོངས་སུ་ཐར་བ་གང་ཡིན་པ་དང་། བསད་པར་འོས་པ་ཤིན་ཏུ་ཡོངས་སུ་གྱུར་པ་བྱིང་བར་གནས་པ་དང་། བཀྲེས་པ་དང་། སྐོམ་པས་ཉེན་པ་དང་། འཇིགས་པ་དང་། སྐྲག་པ་དང་།
en: It is good, O great being with supreme compassion, that you, a pure being, embrace all beings with great compassion in order to save them from the great prison of saṃsāra, where they are immersed in and surrounded by killing and humiliation, are afflicted by hunger and thirst, and experience much fear, dread, anxiety, exhaustion, and pain.

source: ཡིད་འབྱུང་ཞིང་སྐྱོ་བ་དང་། སྡུག་བསྔལ་མང་བ་དེས་ན་སེམས་ཅན་དེའི་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོའི་དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་རིམ་པར་ཕྱེ་བ་དང་། ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་ཆེན་པོ་འདིའི་མིང་འཛིན་པ་དང་། སྒྲ་རྣ་བའི་བུ་གར་ལྷུང་ཞིང་ཐོས་པར་བྱེད་པ་དེའི་སྡུག་བསྔལ་ཆེས་ཆེ་བ་དེ་རྣམས་དང་།
en: Because of your compassion for them, the name of this great sovereign ritual with its collection of maṇḍalas and mudrās that are the essence of Amogharāja will fall upon their ears, and its sound will be heard and apprehended.

source: སྡིག་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་གྲོལ་ཏེ།
en: Because of this, they will be saved from their tremendous suffering and freed from all their evil and obscurations.

source: འཇིགས་པ་ཐམས་ཅད་ཞི་བར་འགྱུར་རོ།
en: They will have peace. “

source: །དམྱལ་བའི་འཇིགས་པ་ཆེན་པོ་ལས་འདོན་ཅིང་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ།
en: Having heard the name of the sovereign ritual, they will be saved from all dangers and released from the terrors of the great hells.

source: །འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པ་རྣམས་སྡིག་པ་ཐམས་ཅད་དང་། དམྱལ་བའི་སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བའི་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་ཡོངས་སུ་ཟད་ཅིང་ཡོངས་སུ་གཏུགས་པར་འགྱུར་རོ།
en: All their karmic obscurations, whether worldly or supramundane, including those that would lead to experiencing all the misfortunes and suffering of hell, will be completely and definitively terminated.

source: །དེ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ལུང་བསྟན་པར་འགྱུར་རོ།
en: They will be blessed and looked after by all the tathāgatas, who will prophesy their future awakening.

source: །ལན་བདུན་ཐོས་པ་ཙམ་གྱིས་སེམས་ཅན་དེ་རྒལ་བར་འགྱུར་རོ།
en: They will be liberated if they hear the name of the sovereign ritual merely seven times.

source: །ཚོགས་ཆེན་པོ་བསགས་པ་དང་། དེ་བཞིན་གཤེགས་པས་དབུགས་ཕྱུང་བ་ཡིན་ནོ། །བྱང་ཆུབ་ཀྱི་ས་བོན་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །སྤྱན་རས་གཟིགས་དབང་ཕྱུག་འོན་ཀྱང་སེམས་ཅན་འདི་དག་ནི་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་དཀྱིལ་འཁོར་དང་།
en: They will acquire great, ocean-like accumulations and will receive comfort from the tathāgatas.

source: ཕྱག་རྒྱ་རིམ་པར་ཕྱེ་བ་དང་བཅས་པའི་ཆོ་ག་ཞིབ་མོ་མཐའ་དག་རྫོགས་པར་ཉན་པར་བྱེད་པ་དང་། ཀློག་པར་བྱེད་པ་དང་། འཆང་དུ་འཇུག་པ་དང་། འདོན་དུ་འཇུག་པ་དང་། མཆོད་པར་བྱེད་པ་དང་། འདྲི་བར་བྱེད་པ་དང་།
en: If the seed of awakening can fully ripen in beings like this, what need is there to mention, O Avalokiteśvara, those beings who hear, study, uphold, propagate, worship, write down, commission copies of, honor, and venerate this heart of Noble Avalokiteśvara-Amoghapāśa, complete with its collection of mantras, mudrās, and all its rites.

source: འདྲིར་འཇུག་པ་དང་། མཆོད་པ་ཆེན་པོ་བྱེད་པ་དེའི་སེམས་ཅན་དེ་རྣམས་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱ་སྟེ།
en: These beings are known to be established irreversibly on the path to awakening.

source: འདི་ལ་ཐེ་ཚོམ་དང་། དོགས་པ་བསྐྱེད་པར་མི་བྱའོ། །འོན་ཀྱང་རིལ་བུ་དང་།
en: This should not be doubted or denied. “

source: མིག་སྨན་དང་།
en: Furthermore, what will happen if someone were to hold an amogha pill, ointment, or incense in their hand?

source: བདུག་པ་ལག་ཏུ་ཐོགས་པར་འགྱུར་བ་དེའི་སེམས་ཅན་དེ་རྣམས་ཆེར་དག་ཅིང་ཀུན་ནས་ཕྱོགས་བཅུ་རྣམས་སུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཉེས་པར་བྱས་པར་འགྱུར་རོ། །ཕྱག་ན་པདྨ་དང་། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོའམ།
en: Such a great being would be purified and would be taken care of by every tathāgata in all ten directions, who will be very pleased with them.

source: དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་དང་། ཀུན་ཏུ་ཁྲོ་བོའི་ཕྱག་རྒྱའི་སྙིང་པོ་འདི་ལན་བདུན་སྨྱུང་བར་གནས་པའི་ཆོ་གས་མཆོད་པ་བྱེད་ཅིང་བཟླས་པ་འབུལ་བར་བྱེད་ཅིང་དབང་སྐུར་བར་བྱེད་པ་དེ་ནི་མཐོང་བའི་ཆོས་ཉིད་ལ་དེ་བཞིན་གཤེགས་པའི་ལུས་སུ་རིག་པར་བྱའོ།
en: It should be known that any son or daughter of good family, a monk or a nun, or a male or a female lay practitioner who performs their worship while displaying the heart mudrā of Krodharāja—the heart essence of Amoghapāśa—while following the fasting ritual that is repeated seven times, and who recites the mantra and performs the consecration, will, O Padmapāṇi, obtain the body of a tathāgata in this earthly life.

source: །དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་དངོས་སུ་མཐོང་སྟེ།
en: They will clearly manifest the nature of a tathāgata and will receive the treasure trove of a tathāgata in their own hand.

source: དེ་བཞིན་གཤེགས་པའི་མཛོད་ལག་ཏུ་སོན་པར་འགྱུར་ཏེ་ཡིད་ཀྱིས་ཐེ་ཚོམ་མི་བྱའོ།
en: This should not be doubted.

source: །འཁོན་དང་དྲེགས་པ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པས་བྱ་སྟེ།
en: Such a person will be completely free of all animosity and arrogance.

source: སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་བཟུང་བས་སེམས་ཅན་དེ་རྣམས་ཐམས་ཅད་ཀྱི་མཐར་ཐུག་པར་འགྱུར་བར་བྱ་ཞིང་བཟླས་པ་སྦྱིན་པར་བྱའོ། །གང་ཡང་དོན་ཡོད་པའི་དཀྱིལ་འཁོར་ཆེན་པོ་འཆད་པར་བྱེད་པ་དང་།
en: They should recite the mantra while visualizing all beings to be near them and embrace them with great compassion. “

source: མཐོང་བ་དང་། ལྟ་བར་བྱེད་པ་དང་། རས་རིས་ཆེན་པོ་འདི་ལྟ་བར་བྱེད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཕྱོགས་བཅུ་ཀུན་ཏུ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་སུ་རྗེས་སུ་ཞུགས་པར་འགྱུར་རོ།
en: Those who enter the great amogha maṇḍala and see either it or the great cloth painting will enter the buddha fields in all ten directions where all the tathāgatas dwell in numbers equal to the grains of sand in the Gaṅgā river.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བ་དམ་ཚིག་ཆེན་པོའི་སྙིང་པོ་རབ་ཏུ་ཞུགས་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་མཐོང་བར་འགྱུར་རོ།
en: They will enter the very essence of the great secret samaya of all the tathāgatas and be able to see the body of every tathāgata.

source: །ཁྲོ་བོའི་རྒྱལ་པོ་འདིས་དབང་བསྐུར་བས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དབང་བསྐུར་བར་འགྱུར་རོ།
en: By receiving the consecration of Krodharāja, one is consecrated by all the tathāgatas.

source: །དེ་ལྟར་ཡོན་ཏན་དང་། ཕན་ཡོན་ཆེན་པོ་དང་། བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ། །དགེ་བའི་རྩ་བ་ཆེན་པོ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: In this way, one acquires great qualities and benefits and a great store of merit, and one plants the roots of great virtue. “

source: །དེ་བཞིན་དུ་ཕན་ཡོན་ཆེན་པོ་དང་། མཐུ་ཆེན་པོ་དང་། ཡོན་ཏན་ཆེན་པོ་བསྐྱེད་པར་བྱ་བ་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་ཆེན་པོའི་ཆོ་ག་སྟེ། ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་ཆེན་པོ་འདི་དང་།
en: The procedures contained in this great sovereign ritual thus bring great benefits, great power, and great qualities.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མིང་འཛིན་པ་དང་མཐོང་བ་ཙམ་གྱིས་མཐོང་བའི་ཆོས་ཉིད་ལ་ཆོ་འཕྲུལ་ཆེས་ཆེ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་རློབ་པ་བལྟ་བ་འདི་དག་མཚུངས་སོ།
en: By merely hearing the name or seeing this great sovereign ritual of the great bodhisattva being Avalokiteśvara, one will see in this very existence great miraculous displays and receive blessings from the tathāgatas.

source: །ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོའི་དཀྱིལ་འཁོར་དང་། སྙིང་པོ་དང་། ཕྱག་རྒྱ་དང་། གཟུངས་དང་། དོན་ཡོད་པའི་རྒྱལ་པོའི་རྣམ་པར་འཕྲུལ་པ་གླེགས་བམ་དུ་བྲིས་པ་ལྟ་བར་བྱེད་པ་འདི་དག་མཚུངས་སོ།
en: Similarly, one who writes in the form of a book this sovereign ritual, with its maṇḍalas, heart mantras, mudrās, and dhāraṇīs, will witness the miracles of Amogharāja.

source: །དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དང་མཉམ་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་རྣམས་མཐོང་བར་འགྱུར་རོ།
en: Such a vidyā holder will be able to see hundreds of thousands of millions of tathāgatas, worthy, fully realized buddhas equal in number to the grains of sand in the Gaṅgā river.

source: །དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཐམས་ཅད་དུ་ཡང་དག་པར་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ། །ཡང་དག་པར་སྲུང་བའི་ཆེད་དང་། ཡང་དག་པར་དབུགས་འབྱིན་པའི་ཆེད་དུ་མཐོང་བར་གནས་སོ།
en: All these tathāgatas will stand by in order to protect him and give him comfort, and they will appear to him.

source: །གླེགས་བམ་བྲིས་པ་འདི་ཡང་མཐོང་བ་ཙམ་གྱིས་མཚམས་མེད་པའི་ལས་རྣམས་དང་། སྔོན་གྱི་སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་ཟད་པ་དང་ཡོངས་སུ་གཏུགས་པར་འགྱུར་རོ།
en: The mere sight of the book thus copied will ensure that the five acts of immediate retribution are completely purified and that all the previously accumulated obscurations will come to a complete and final end. “

source: །མཐོང་བའི་ཆོས་ཉིད་ལ་དཔལ་དང་། གཡང་མང་པོ་དང་། གཟི་བརྗིད་དང་ལྡན་པར་འགྱུར་རོ།
en: The vidyā holder will thus obtain, in this very life, great splendor, good fortune, and glory.

source: །ཤི་འཕོས་ནས་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་པདྨ་ལས་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ།
en: After he dies, he will go to the realm of Sukhāvatī, where he will be spontaneously born from a lotus flower.

source: །འདི་ནི་སྐྱེ་བའི་ཐ་མའོ། །གླེགས་བམ་འདི་མཐོང་ན།
en: The birth in which he sees the book will be his last.

source: ཚེ་དང་བྲལ་བ་ཡང་ཚེ་འཕེལ་བར་འགྱུར་རོ།
en: Even though his original lifespan was spent, his life will be extended.

source: །ནད་རྣམས་དང་བྲལ་བར་འགྱུར་རོ། །སྒྲིབ་པ་དང་། ཁྲོ་བ་དང་བྲལ་བར་འགྱུར་རོ།
en: All his diseases will disappear, as will his obscurations and anger.

source: །མཆོག་ཆེན་པོ་གྲུབ་པར་འགྱུར་རོ། །གྲུབ་པ་ཆེན་པོ་དང་། རྣལ་འབྱོར་གྱི་དབང་ཕྱུག་ཏུ་འགྱུར་རོ། །ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་དང་ལྡན་པར་ཡང་འགྱུར་རོ།
en: He will attain a great, supreme accomplishment, become the master of great siddhas and yogins, and be endowed with every good fortune and quality.

source: །གླེགས་བམ་འདི་ནི་ཆོས་ཀྱི་དབྱིངས་དང་མཉམ་པའི་དེ་བཞིན་གཤེགས་པ་དང་མཚུངས་པར་རིག་པར་བྱའོ།
en: This book should therefore be known to be equal in status to a tathāgata who abides in the dharmadhātu.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བཞིན་འཛུམ་ཞིང་སྙིང་གཡོ་བ་དང་བཅས་པ་འོད་ཟེར་འབར་ཞིང་སྣང་བར་བྱེད་བཞིན་པ་རྒྱན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་གིས་ཡང་དག་པར་བརྒྱན་པའི་ལུས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ལ་པདྨོ་ཡངས་པའི་དཀྱིལ་འཁོར་ཆེན་པོར་ཀུན་ནས་དོན་ཡོད་པའི་རས་རིས་བལྟ་བ་དང་།
en: Noble Avalokiteśvara, the great bodhisattva being, bowed with folded hands to the Blessed One and, with a smiling face and beating heart, spoke while facing the Blessed One, whose body was shining bright with hundreds of thousands of millions of light rays: “There is, O lord, in my great lotus maṇḍala, a teaching on the panoptic amogha cloth-painting that constitutes the heart essence of Amoghapāśa.

source: དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་གང་གིས་དོན་ཡོད་པའི་རས་རིས་ཀྱི་བྱ་བས་དེ་རྣམས་ཐམས་ཅད་ལ་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱི་མཐོང་བའི་རྣམ་འཕྲུལ་སྟོང་ཕྲག་མང་པོ་མཐོང་བ་དང་། རྣམ་པ་སྣ་ཚོགས་གཟུགས་དང་། ཁ་དོག་དང་། རྟགས་མཐོང་བ་དང་། གཟུགས་གཅིག་གི་རྗེས་སུ་འཇུག་པར་མཚུངས་སོ་ཞེས་མི་འཇུག་གོ། །འདི་ལྟ་སྟེ། དབང་ཕྱུག་དང་།
en: When this amogha painting is being executed, many thousands of deity images of various forms and colors and that bear various insignia, are surrounded by magical displays, and are generated by the illusion-like samādhi will enter the painting together as a single form and single body.

source: དབང་ཕྱུག་ཆེན་པོ་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་ཕྱུགས་བདག་ཆེན་པོ་དང་། གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་དང་། དྲང་སྲོང་གི་ཚོགས་དང་། གཞོན་ནུ་དང་། དེད་དཔོན་དང་། ཚོང་པ་དང་། རིག་སྔགས་འཆང་དང་། ཟླ་བ་དང་། ཉི་མ་དང་། རྒྱུ་སྐར་དང་།
en: They include the forms of Īśvara, Maheśvara, Brahmā, Viṣṇu, Maheśvara, the great Paśupati, Yama, Varuṇa, Kubera, the hosts of ṛṣis, Kumāra, the merchant Sārthavāha, the vidyādharas, Candra, Sūrya, the nakṣatras, and the multitude of stars.

source: སྐར་མའི་ཚོགས་ལུས་གཅིག་པུས་རྗེས་སུ་འཇུག་པར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་གང་གིས་མཐོང་བ་ཙམ་གྱི་མོད་ལ་དོན་ཡོད་པའི་ཞགས་པའི་དཀྱིལ་འཁོར་ཆེན་པོ་དང་། དམ་ཚིག་དང་། ཕྱག་རྒྱ་དང་། ཆོ་ག་ཞིབ་མོའི་སྒྲུབ་པ་ཆེན་པོ་དེ་རྣམས་ཐམས་ཅད་གྲུབ་པར་འགྱུར་རོ།
en: By merely beholding this painting, one can accomplish the great maṇḍalas, samayas, and mudrās and all the great sādhana-rites of Amoghapāśa.

source: །གྲུབ་པའི་དམ་ཚིག་རྗེས་སུ་ཞུགས་པར་འགྱུར་རོ།
en: One can enter the samayas that lead to accomplishment. “

source: །དོན་ཡོད་པ་ཆེན་པོའི་གསང་སྔགས་དང་། སྙིང་པོ་དང་།
en: I will now pronounce the great samaya-dhāraṇī, an amogha heart mantra, so that all beings may attain happiness.

source: གཟུངས་དང་། དམ་ཚིག་རྗེས་སུ་སྩལ་བར་བགྱིའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་སྒྲུབ་པའི་ཆེད་དུ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མངོན་སུམ་དུ་འདུག་པར་འགྱུར་རོ། །རིག་སྔགས་འཆང་རྣམས་ཀྱི་མཆོག་གི་དངོས་གྲུབ་ཀྱི་ཆེད་དང་། རེ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་ཆེད་དུ་ཀློག་པ་དང་སྒྲུབ་པར་བྱེད་པའོ།
en: I will pronounce it, in front of you, the Blessed One, so that the vidyā holders may attain supreme accomplishment by reciting it, and so that everyone’s wishes will be fulfilled. “

source: །ན་མ་སྟྲཻ་ཡ་དྷྭི་ཀཱ་ནཱཾ་ཏ་ཐཱ་ག་ཏཱ་ནཱཾ།
en: Homage to the tathāgatas of the three times! [

source: ཨོཾ་ཨ་མོ་གྷ་པདྨ་པཱ་ཤ་ཀྲོ་དྷཱ་ཀརྵ་ཡ་པྲ་བེ་ཤ་ཡ་མ་ཧཱ་པ་ཤུ་བ་ཏཾ་ཡ་མ་བ་རུ་ཎ་ཀུ་བེ་ར།
en: 198] “Oṁ, O wrathful one with the amogha lotus noose!

source: བྲཧྨ་བེ་ཥ་དྷ་ར།
en: Pull them in and make them enter! You wear the garb of the great Paśupati and of Yama, Varuṇa, Kubera, and Brahmā.
